## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;private-law&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;prl&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;private-law&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;et-sya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;ia-aip&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;manage-payments&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;private-law&#34;]
* Replace
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;lau&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["private-law"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-apply-to-court-about-child-arrangements-c1"
      + origin_host_header            = "hmctsprivatelshutterprod.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-prl"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = "hmctsprivatelshutterprod.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsprivatelshutterprod-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_profile.main["prl"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-prl"
      + resource_group_name = "shutter-app-prod-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.shutter.azurerm_template_deployment.custom_domain["private-law"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "apply-to-court-about-child-arrangements-c100"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "www.apply-to-court-about-child-arrangements-c100.service.gov.uk"
          + "name"     = "hmcts-shutter-prl/hmcts-apply-to-court-about-child-arrangements-c1/www-apply-to-court-about-child-arrangements-c100-service-gov-uk"
        }
      + resource_group_name = "shutter-app-prod-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["et-sya"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "d90d972714f442f09f33f3efc2b37666"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["ia-aip"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9427d4e5db9340898a631dc4359f10d3"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["lau"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "5117070955992795122" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "eaea1286114e4990a5c94d560d0e462e" -> "cfb39ac9b95043958d11183adebeb62f"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["manage-payments"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "54044681188744409aebeadd49f935b3"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["private-law"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "bfa4a0af6146404f8e6d43715a75de42"
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1544,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->